//
//  LetterType.swift
//  Love letter
//
//  Created by KJW on 2022/07/06.
//

import Foundation

enum LetterType: String {
    case letter1 = "이건 내 주인님에게 보내는 편지들이예요. 고백 그 이후에 이렇게...감정을 적어서 보내는 것은 또 오랜만이네요. 아직도 생각해요. 저희가 만났을 그 때를. 저에게 말해줬던 다정한 말들과 행동들을 아직 기억하고 있어요. 덕분에 행복한 시간을 보낼 수 있게 되었죠. 주인님을 만나게 되어서 참 다행이라고 생각해요. 항상 사랑을 담아서 보낼께요. "
    
    case letter2 = "오늘은 어땠나요? 날씨가 좋았을까요? 아님 좋은 일이 생겼을까요. 그것도 아니라면 맛있는 식사라도 했을까요. 만약 그렇지 않다 해도 좋은 일이 생길거라 믿어요. 유독 힘든 날이라면 말해주세요, 제가 주인님꼐 한 송이의 꽃을 드릴께요. 가장 예쁜 꽃으로요. 그게 도움이 된다면 언제든지 계속이요. 제 마음속의 꽃밭에는 주인님을 위한 꽃이 한가득 피어 있으니까요. 언제나 사랑을 담아서"
    
    case letter3 = "문득 노래를 듣다가 주인님이 생각이 났어요. 노래 가사에서 그러더라고요...널 떠나지 않을께, 마지막 날이 오면 안아줄게. 네가 날 필요로 하면 어떡해. 날 안아줄래 우리의 마지막 날. 이런 가사였는데 주인님이 생각이 났었어요. 꼭 제게 해주실 법한 그런 말들이여서 그런걸까요? 전 그렇게 생각되네요. 나도 주인님을 떠나지 않을거에요. 제가 어떻게 가겠어요...제 끝은 주인님 옆이니까요. 언제나 사랑을 담아서"
    
    case letter4 = "요새 일이 힘들지는 않을까 걱정이 되네요. 아무래도 날이 무더워서 지치기 쉬운 편이니까요. 저도 멍하니 보내는 시간이 많아지는 것 같아서 문제랄까요. 있죠, 날이 더 더워지면 또 다시 바다로 여행을 갈까요? 처음 여행가서 같이 봤던 바다가 너무 예뻤거든요. 또 함께 여행가서 같이 바다를 보고 싶어요. 바닷가면 더 시원하기도 할테고...괜찮다면 후에 대답해주세요. 언제나처럼 사랑을 담아서"
    
    case letter5 = "가끔 생각해요. 주인님이 왜...저를 선택하셨는지 말이에요. 매번 귀엽다고, 예쁘다고 말해주실 때마다 행복하고 좋지만 부끄럽기도 했어요. 주인님은 저보다 대단한 사람이니까... 더 멋있거나 예쁜 사람들이 주변에 많지 않았나..했으니까요. 처음엔 믿기 힘들었고 잘 받아들여지지 않았지만 그래도 지금은 아니에요. 아니, 그냥 주인님의 말을 믿기로 했달까요? 그저 당신에게 더 좋은 사람이 되고 싶은 제 마음이에요. 어쩐지 조금 부끄러우니 그만 쓸게요. 사랑을 담아서 이만"
    
    case letter6 = "주인님은 저를 생각하고 계실까요? 나름 전 자주 생각해요. 문든 올려다 본 하늘이 예뻐서, 오늘 마셨던 커피가 맛있어서. 아니면 길가에 이름 모를 들꽃이 예쁘게 피어 있으면 같이 보면 좋겠다라는...생각을 하면서 말이죠. 제 사랑하는 사람, 주인님. 자주는 아니더라도 가끔, 아주 가끔씩은 저를 생각해 주시기를 바란다면 조금 욕심일까요? 보고싶은 마음과 사랑을 담아서"
    
    case letter7 = "주인님과 같이 하고 싶은 일들이 점점 늘어나요. 햇빛이 좋은 날 같이 마주보면서 책을 읽고 싶어요. 같이 영화관을 가는 것은 어떤가요? 옷도 골라드리고 싶고 같이 사진을 찍으러 가고 싶다는 상상도 많이 해요. 점점 이렇게 옥심만 늘어가는데 괜찮은 걸까요? 처음에는 그저 오래, 옆에 같이 있고 싶은 것 뿐이었는데. 어쩌면 조금 나쁜 고양이일 수 있겠어요, 저는... 언제나처럼 사랑을 담아서"
}
